NextFOAM-2405/tutorials/incompressible/pimpleFoam/laminar/inclinedPlaneFilm/0/hf_film
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaScalarField;
    object      hf_film;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.000141;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
        phi             phi2s_film;
    }

    side
    {
        type            zeroGradient;
    }

    symmetry
    {
        type            zeroGradient;
    }

    cylinder
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
